artillery.yml
config:
  target: "http://localhost:3008"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 120
      arrivalRate: 50
      name: Sustained load
scenarios:
  - name: "Search by productId"
    flow:
      # Get the details of the product:
      - get:
          url: "/product/{{ $randomNumber(1000000,10000000) }}/"